{"uri":"965791517","lang":"eng","isDuplicate":false,"date":"2018-10-10","time":"05:21:00","dateTime":"2018-10-10T05:21:00Z","dataType":"news","sim":0,"url":"https://gantdaily.com/2018/10/10/dubois-city-parking-ordinance-tops-council-meeting/","title":"DuBois City Parking Ordinance Tops Council Meeting","body":"DUBOIS - On Oct. 1, DuBois City officials began re-enforcing an existing ordinance, which prohibits parking between the road and sidewalk.\n\nAt Monday night's regular council meeting, area residents showed up to complain, some with their tickets in-hand.\n\nCouncil members indicated they would explore other solutions in order to balance enforcement and the adverse impact on residents.\n\nAccording to previously-published GANT News reports, the ordinance's enforcement was driven by two issues with the first being to keep the city \"visually attractive.\"\n\nSecondly, city officials have cited its necessary for safety reasons because at some intersections, vehicles were being parked in the right-of-way, which made it difficult to see oncoming traffic.\n\nInitially, city officials' suggested solutions encompassed having residents either park on- or off-the-street properly as permitted under the ordinance.\n\nHowever, on-street parking was protested for a number of reasons. Most importantly, it was noted if vehicles were parked along both sides, then emergency vehicles wouldn't be able to pass through.\n\nIn addition, officials pointed out that sometimes it becomes necessary to remove vehicles from streets in order to clear a passageway for street cleaners, snow plows, etc.\n\nSome residents advised city officials that for age and health reasons, it's already difficult enough to move their vehicles and walk back to their homes.\n\nCity officials have also suggested that residents use or create a parking space on their properties that would be permitted under the ordinance.\n\nThis, residents protested, could possibly harm their yards, if they even had the space.\n\nIt was suggested for residents to park off the alleyway, which aroused concerns that an alley could be considered a roadway under the existing ordinance.\n\nSolicitor Toni Cherry said she would look into the ordinance to confirm that it wouldn't and if it did, she suggested that it could be revised by the city.\n\nRobert Little, who has a real estate background, commented: \"It is really going to affect the property values here in the city.\" He also warned it's not easy to sell homes that don't have off-street parking.\n\nLittle showed council members photographs of his own home to demonstrate the inability to park at his property without parallel, off-street parking.","source":{"uri":"gantdaily.com","dataType":"news","title":"Clearfield Gant Daily"},"authors":[{"uri":"steven_mcdole@gantdaily.com","name":"Steven McDole","type":"author","isAgency":false}],"eventUri":null,"location":null},{"uri":"965791522","lang":"eng","isDuplicate":false,"date":"2018-10-10","time":"05:21:00","dateTime":"2018-10-10T05:21:00Z","dataType":"news","sim":0,"url":"https://gantdaily.com/2018/10/10/pa-first-lady-commission-for-women-host-roundtable-on-equal-pay-call-for-solutions-to-end-gender-pay-gap/","title":"PA First Lady, Commission for Women Host Roundtable on Equal Pay, Call for Solutions to End Gender Pay Gap","body":"PHILADELPHIA - First Lady Frances Wolf and members of the Pennsylvania Commission for Women on Tuesday joined business leaders, lawmakers and advocates for a roundtable discussion at PECO headquarters in Philadelphia, which focused on Gov. Tom Wolf's executive action to address the gender pay gap in state government and the need to enact similar policies to protect all women in Pennsylvania from gender-based pay discrimination.\n\n\"When women are paid just 80 cents on the dollar of what men are paid, we have a real problem. And the numbers are even more staggering for women of color,\" the First Lady said.\n\n\"We have taken steps to eliminate the gender pay gap for Pennsylvania state employees, but we need to do more. It's a matter of fairness, and of doing what's right for Pennsylvania families.\"\n\n\"Reducing and eliminating the gender pay gap is a priority for PECO and our parent company, Exelon,\" said PECO President and Chief Executive Officer Mike Innocenzo.\n\n\"We have made tremendous strides through the adoption of industry-leading pay equity practices, which continue to help us attract and retain women at our company.\"\n\nOn June 6, Wolf signed Executive Order: 2018-18-03 - Equal Pay for Employees of the Commonwealth, which directs state agencies under the Governor's jurisdiction to:\n\nThe Executive Order, which applies to management-level positions, took effect 90 days from the day it was signed.\n\n\"The gender pay gap is wrong. It is wrong for women, it is wrong for families and it is wrong for Pennsylvania,\" said Randi Teplitz, chair of the Pennsylvania Commission for Women.\n\n\"The commission for Women was proud to stand with Governor Wolf when he signed his executive order banning this practice in state government, but now we must come together to ensure that no woman in Pennsylvania is paid less simply because of her gender.\"\n\nThe First Lady and Commission for Women were joined by advocates who have been strong voices to end the pay gap in the state capitol and throughout Pennsylvania, including the American Association of University Women.\n\n\"Pay equity is not just a matter of fairness but the key to families making ends meet,\" said AAUW-PA Public Policy Co-Chair Barbara Price.\n\n\"Wage discrimination limits women's choices and has real consequences. It impairs their ability to buy homes and pay for a college education and limits their total lifetime earnings, thereby reducing their retirement savings and benefits.\"\n\nWomen working full-time, year-round in Pennsylvania are paid just 80 cents on the dollar of what men are paid. That gap widens among women minorities, with African-American women making 63 cents on the dollar, Native American women making 57 cents on the dollar and Latina women making 54 cents on the dollar.\n\nPennsylvania ranks 24th out of the 50 states for pay disparity, and fifth among its seven surrounding states.\n\nTo learn more about the movement to close the gender pay gap in Pennsylvania, visit the Pennsylvania Commission for Women's Equal Pay Advocacy web page.","source":{"uri":"gantdaily.com","dataType":"news","title":"Clearfield Gant Daily"},"authors":[{"uri":"gant_team@gantdaily.com","name":"Gant Team","type":"author","isAgency":false}],"eventUri":null,"location":{"type":"place","label":{"eng":"Philadelphia"},"lat":39.95233,"long":-75.16379,"country":{"type":"country","label":{"eng":"United States"},"lat":39.76,"long":-98.5}}},{"uri":"965791452","lang":"eng","isDuplicate":true,"date":"2018-10-10","time":"05:21:00","dateTime":"2018-10-10T05:21:00Z","dataType":"news","sim":0,"url":"https://www.ibj.com/articles/70809-market-forces-put-americas-recycling-industry-in-the-dumps?v=preview","title":"Market forces put America's recycling industry in the dumps","body":"A crash in the global market for recyclables is forcing communities to make hard choices about whether they can afford to keep recycling or should simply send all those bottles, cans and plastic containers to the landfill.\n\nMountains of paper have piled up at sorting centers, worthless. Cities and towns that once made money on recyclables are instead paying high fees to processing plants to take them. Some financially strapped recycling processors have shut down entirely, leaving municipalities with no choice but to dump or incinerate their recyclables.\n\n\"There's no market. We're paying to get rid of it,\" says Ben Harvey, president of EL Harvey & Sons, which handles recyclables from about 30 communities at its sorting facility in Westborough, Massachusetts. \"Seventy-five percent of what goes through our plant is worth nothing to negative numbers now.\"\n\nIt all stems from a policy shift by China, long the world's leading recyclables buyer. At the beginning of the year it enacted an anti-pollution program that closed its doors to loads of waste paper, metals or plastic unless they're 99.5 percent pure. That's an unattainable standard at U.S. single-stream recycling processing plants designed to churn out bales of paper or plastic that are, at best, 97 percent free of contaminants such as foam cups and food waste.\n\nThe resulting glut of recyclables has caused prices to plummet from levels already depressed by other economic forces, including lower prices for oil, a key ingredient in plastics.\n\nThe three largest publicly traded residential waste-hauling and recycling companies in North America -- Waste Management, Republic Services and Waste Connections -- reported steep drops in recycling revenues in their second-quarter financial results. Houston-based Waste Management reported its average price for recyclables was down 43 percent from the previous year.\n\n\"A year ago, a bale of mixed paper was worth about $100 per ton; today we have to pay about $15 to get rid of it,\" says Richard Coupland, vice president for municipal sales at Phoenix-based Republic, which handles 75 million tons of municipal solid waste and 8 million tons of recyclables nationwide annually. \"Smaller recycling companies aren't able to stay in business and are shutting down.\"\n\nKirkwood, Missouri, announced plans this summer to end curbside recycling after a St. Louis-area processing facility shut down. Officials in Rock Hill, South Carolina, were surprised to learn that recyclables collected at curbside were being dumped because of a lack of markets. Lack of markets led officials to suspend recycling programs in Gouldsboro, Maine; DeBary, Florida; Franklin, New Hampshire; and Adrian Township, Michigan. Programs have been scaled back in Flagstaff, Arizona; La Crosse, Wisconsin; and Kankakee, Illinois.\n\nOther communities are maintaining recycling programs but taking a financial hit as regional processors have raised rates to offset losses. Richland, Washington, is now paying $122 a ton for Waste Management to take its recycling; last year, the city was paid $16 a ton for the materials. Stamford, Connecticut, received $95,000 for recyclables last year; the city's new contract requires it to pay $700,000.\n\nA big part of the problem, besides lower commodity prices overall, is sloppy recycling.\n\nIn the early days of recycling, people had to wash bottles and cans, and sort paper, plastic, glass and metal into separate bins. Now there's single-stream recycling, which allows all recyclables to be tossed into one bin. While single-stream has benefited efficiency, and customers like it, it's been a challenge on the contamination side.\n\nA tour of Republic's facility in Beacon, about an hour's drive north of New York City, makes the challenges clear. A third of the material dumped by collection trucks is non-recyclable \"contaminants\" such as garden hoses, picnic coolers and broken lawnmowers. Workers have to pull that out and truck it to a landfill, adding to overall costs. Plastic bags contaminate bales of other materials and tangle machinery. Spilled ketchup and greasy pizza boxes turn otherwise marketable material into garbage.\n\n\"The death of recycling was completely avoidable and incredibly easily fixed,\" says Mitch Hedlund, executive director of Recycle Across America, which advocates standardized labeling on recycling bins so people understand what goes in and what doesn't.\n\nA range of initiatives have been launched to get people to recycle right. Chicago is putting \"oops\" tags on curbside recycling bins with improper contents and leaving them uncollected. Rhode Island is airing \"Let's Recycle Right\" ads.\n\nWhile some recyclables have been diverted to other Asian markets since China's closure, there are also signs of market improvement in the U.S. to offset the lost business, said David Biderman, CEO and executive director of the Solid Waste Association of North America. He noted Chinese paper manufacturers that had relied on recyclables imported into their country have recently purchased shuttered mills in Kentucky, Maine and Wisconsin.\n\nMeanwhile, recyclable materials processors are re-negotiating contracts with municipalities to reflect the fact that prices paid for recyclables no longer offset the cost of collecting and sorting them.\n\n\"What we're advocating is to step back and re-look at recycling,\" Republic's Coupland said. \"This is the new normal. The model no longer funds itself.\"","source":{"uri":"ibj.com","dataType":"news","title":"Indianapolis Business Journal"},"authors":[{"uri":"associated_press@ibj.com","name":"Associated Press","type":"author","isAgency":false}],"eventUri":null,"location":null},{"uri":"965791587","lang":"eng","isDuplicate":false,"date":"2018-10-10","time":"05:22:00","dateTime":"2018-10-10T05:22:00Z","dataType":"news","sim":0,"url":"https://www.hawaii247.com/2018/10/09/aclu-response-to-hawaii-countys-statement-regarding-not-issuing-a-drivers-license-to-a-woman-with-headscarf/","title":"ACLU response to Hawaii County's statement regarding not issuing a driver's license to a woman with headscarf","body":"\"The County's response is misleading. It seeks to justify its violations of the Constitution by claiming they were unaware of the Department of Homeland Security's guidance on the REAL ID Act and religious accommodation - which were in fact published on the DHS website as early as 2016. The County of Hawaii's discriminatory enforcement of the REAL ID Act's photo requirements against Muslim women and women wearing headscarves -- but not against people whose hair naturally covers their ears -- violates the First Amendment to the Constitution regardless of County officials' flawed understanding of what \"ear-to-ear\" means.\n\nFinally, when Ms. O'Dell states that as soon as the County became aware of the correct interpretation of the DHS rules, it issued the license, she neglects to mention that it was Ms. Tobosa herself who sent her the link to the DHS's guidance on April 18, 2018, after which Ms. O'Dell, without explanation, suddenly reversed course that same day and told Ms. Tobosa that her application would be granted. It is only thanks to Ms. Tobosa's diligence and persistence that the County's longstanding misinterpretation and unconstitutional application of what the REAL ID Act requires was brought to light.\n\nRegardless of how this profound misinterpretation of the REAL ID Act arose, we are glad that the County is now acknowledging this error, and are hopeful that it will fully comply with our demand letter and treat all who enter the DMV with respect and equality.\"","source":{"uri":"hawaii247.com","dataType":"news","title":"Hawaii 24/7"},"authors":[],"eventUri":null,"location":null},{"uri":"965791521","lang":"eng","isDuplicate":false,"date":"2018-10-10","time":"05:21:00","dateTime":"2018-10-10T05:21:00Z","dataType":"news","sim":0,"url":"https://gantdaily.com/2018/10/10/october-is-domestic-violence-awareness-month/","title":"October is Domestic Violence Awareness Month","body":"CLEARFIELD - October is Domestic Violence Awareness Month and the Community Action Crossroads Project needs support to help reach more victims of abuse.\n\nAt Tuesday's Clearfield County Commissioners' meeting, Director Suella Himes reported that 117 people died from domestic violence in Pennsylvania in 2017 and sadly two were in Clearfield County.\n\nThe county also started the current fiscal year with another death. \"It tells us we need to work harder and we're not reaching as many victims as we need to,\" she said.\n\nAccording to Himes, in 2017-18 Crossroads served 1,295 domestic violence victims; provided 3,721 counseling hours; and sheltered 42 people for a total of 1,027 nights.\n\nShe said Crossroads provides a 30-day emergency stay, but it's impossible to believe a victim can come in, overcome their crisis, find employment and new housing, etc. in that timeframe.\n\nShe said the Crossroads staff works with people and grants extensions when it can. Unfortunately, she said it's already exhausted its relocation monies and it's only Oct. 9.\n\nAs a result, Himes said Crossroads is seeking additional programs and resources to assist the current 11 people being housed. She said if other options aren't identified, they will continue to shelter these people because they will not send them home where it's not safe.\n\nIn Clearfield County, she said everyone knows someone - a co-worker, friend or acquaintance - who has been affected by domestic violence. During the 2010 U.S. Census, there were 81,642 people living in the county.\n\nOne-in-four women, or 20,410, are victims of domestic violence and one-in-five men, or 16,328. \"It's very overwhelming when you look at those numbers,\" she said. \"And, to know you're not able to reach as many people as you need to.\"\n\nHimes said the Crossroads hopes to draw upon community support through volunteerism and educational presentations. She also invites local businesses and churches to display their posters to create awareness.\n\n\"Everyone is in touch with somebody,\" she said. \"With help, it could be very impactful.\"\n\nCounselor/Legal Advocate Tammy Kyler shared information about the Crossroads Lethality Assessment Program, which was implemented in June of 2017. She explained that during a domestic call, an officer will call from on-scene.\n\nShe said a representative will speak to the victim for no more than 10 minutes to determine how to ensure their safety at that moment. Since 2017, she said Crossroads has received 17 \"high-danger\" calls and 12 \"non-high-danger\" calls with 19 people still continuing services.\n\nKyler said the Clearfield County Sheriff's Department and both the Clearfield and Curwensville Borough police are participating in this program. She said other local police agencies are giving it consideration.\n\nCrossroads has two legal offices and two shelters and is currently staffed by 12 people. However, Himes noted there were only 10 staff members up until about two months ago.\n\nIn other business, the commissioners:\n\nDuring the county's regular salary board meeting, members:","source":{"uri":"gantdaily.com","dataType":"news","title":"Clearfield Gant Daily"},"authors":[{"uri":"jessica_shirey@gantdaily.com","name":"Jessica Shirey","type":"author","isAgency":false}],"eventUri":null,"location":{"type":"place","label":{"eng":"Clearfield County, Pennsylvania"},"lat":41.00019,"long":-78.47411,"country":{"type":"country","label":{"eng":"United States"},"lat":39.76,"long":-98.5}}},{"uri":"965791492","lang":"eng","isDuplicate":true,"date":"2018-10-10","time":"05:21:00","dateTime":"2018-10-10T05:21:00Z","dataType":"news","sim":0,"url":"https://www.star-telegram.com/news/nation-world/national/article219769380.html","title":"Florida Panhandle braces for 1st major hurricane in years | Fort Worth Star-Telegram","body":"Michael roared down on the Florida Panhandle as a fast-strengthening major hurricane, gaining so much in unexpected fury that forecasters predicted it would become a Category 4 monster before it crashes later Wednesday against the region's white-sand beaches, fishing villages and coastal communities.\n\nThe unexpected brute that quickly sprang from a weekend tropical depression grew swiftly, rising in days from a tropical storm to a Category 3 hurricane and then flirting with potentially catastrophic Category 4 power. Around midday it was expected to become one of the Panhandle's worst hurricanes in memory with 125 mph winds and a life-threatening storm surge of up to 13 feet (4 meters).\n\nFlorida officials said roughly 375,000 people up and down the Gulf Coast had been urged or ordered to evacuate. Evacuations spanned 22 counties from the Florida Panhandle into north central Florida. But fears lingered that some failed to heed the calls to get out of Michael's way as the hard-charging storm began speeding north over the warm waters of the Gulf of Mexico.\n\nWorried meteorologists said it had the potential of becoming one of the worst storms in the history of Florida's Panhandle.\n\n\"I guess it's the worst case scenario. I don't think anyone would have experienced this in the Panhandle,\" meteorologist Ryan Maue of weathermodels.com told The Associated Press. \"This is going to have structure damaging winds along the coast and hurricane force winds inland.\"\n\nUniversity of Georgia's Marshall Shepherd, a former president of the American Meteorological Society, called it a \"life-altering event\" on Facebook and said he watched the storm's growth on satellite images with a pit growing in his stomach.\n\nFranklin County Sheriff A.J. Smith near the vulnerable coast said his deputies had gone door to door in some places urging people to evacuate. \"We have done everything we can as far as getting the word out,\" Smith said. \"Hopefully more people will leave.\"\n\nOn the exposed coast of Florida's Big Bend, most of the waterfront homes in Keaton Beach stood vacant amid fears of a life-threatening storm surge in an area that hadn't seen a potentially catastrophic major hurricane in decades. Even so, 77-year-old resident Robert Sadousky wasn't quite ready to evacuate yet.\n\nThe retired mill worker has spent more than half his life on the coast and weathered his share of storms. He chose the spot where his house stands on tall stilts overlooking the Gulf waters in 1972 after it was the only lot left dry after a storm flooded the beach that year.\n\nWhile most homes around him are vacation rentals or summer getaways for their owners, Sadousky had stayed put through more than four decades of storms. No longer. Michael was expected to bring surging seas up 9 feet (2.75 meters) above ground level at Keaton Beach.\n\n\"I know it's going to cover everything around here,\" Sadousky said Tuesday, eyeing water lapping at the edge of a canal behind his home. He pulled two small boat docks from the water, packed his pickup and picked some beans from his garden before getting out -- like hundreds of thousands elsewhere.\n\nAt 11 p.m. Tuesday, the eye of Michael was about 220 miles (355 kilometers) south-southwest of Panama City, Florida. It also was about 200 miles (325 kilometers) south-southwest of Apalachicola, Florida. But forecasters said winds and outer rain bands of a storm that was strengthening and becoming better organized by the hour would begin lashing the coast well ahead of the eye making landfall.\n\nMore than 180,000 people of those leaving were under mandatory evacuation orders, the long lines of cars jamming routes out Tuesday.\n\n\"We don't know if it's going to wipe out our house or not,\" Jason McDonald, of Panama City, said as he and his wife drove north to safety into Alabama with their two children, ages 5 and 7. \"We want to get them out of the way.\"\n\nFlorida Gov. Rick Scott warned it was a \"monstrous hurricane,\" and his Democratic opponent for the Senate, Sen. Bill Nelson, said a \"wall of water\" could cause destruction along the Panhandle.\n\n\"Don't think that you can ride this out if you're in a low-lying area,\" Nelson said on CNN.\n\nBut some officials were worried by what they weren't seeing -- a rush of evacuees.\n\n\"I am not seeing the level of traffic on the roadways that I would expect when we've called for the evacuation of 75 percent of this county,\" Bay County Sheriff Tommy Ford said.\n\nIn the dangerously exposed coastal town of Apalachicola, population 2,500, Sally Crown planned to go home and hunker down with her two dogs.\n\n\"We've been through this before,\" she said. \"This might be really bad and serious. But in my experience, it's always blown way out of proportion.\"\n\nMandatory evacuation orders went into effect in Panama City Beach and other low-lying areas in the storm's path. That included Pensacola Beach but not in Pensacola itself, a city of about 54,000.\n\nMichael could dump up to a foot (30 centimeters) of rain over some Panhandle communities before its remnants go back out to sea by way of the mid-Atlantic states over the next few days. Forecasters said it also could bring 3 to 6 inches of rain to Georgia, the Carolinas and Virginia, triggering flash flooding in a corner of the country still recovering from Florence. And isolated tornadoes were also possible.","source":{"uri":"star-telegram.com","dataType":"news","title":"star-telegram"},"authors":[{"uri":"brendan_farrington@star-telegram.com","name":"Brendan Farrington","type":"author","isAgency":false}],"eventUri":null,"location":null},{"uri":"965791560","lang":"eng","isDuplicate":false,"date":"2018-10-10","time":"05:22:00","dateTime":"2018-10-10T05:22:00Z","dataType":"news","sim":0,"url":"http://www.sbsun.com/just-rename-the-u-s-a","title":"Just rename the U.S.A.","body":"Let's just rename the United States of AmericaSince we now celebrating Indigenous Peoples Day instead of that tyrant Christopher Columbus, I think that we should ditch the name of America because Amerigo Vespucci (the United States of America was named after him) never had much to do with the United States of America.He was a great explorer and without him and other brave explorers we would never have the new world.Columbus was a great explorer and should not be thrown out of society for his brave explorations.If we take away all the explorers who tried to learn where they were going -- and yes, they brought sickness and other faults with them -- we would not have a world today.If Columbus Day has to be renamed we should also rename America. Also, we should destroy Mount Rushmore and rename Washington because the Founding Fathers had slaves. That's next. Only fair. -- Jacqueline Mahoney, ClaremontVoting yes on Prop. 6 means worse roadsRe \"Proposition 6 is a grassroots initiative\" (Opinion, Oct. 8):If Proposition 6 passes and reduces the funding for road maintenance and repairs, the state will have to de-prioritize many projects.Consciously or subconsciously, one of the deciding factors for state staff will be whether the project is where most people voted to reduce the funding or voted to keep it.If you and a majority of your neighbors vote for Prop. 6, your area will probably have worse roads than areas which voted against it. That would be fair. -- Bob Gerecke,ClaremontWe need more info about those in governor's raceIt's no wonder a lot of the people are uninformed about who they are voting for governor. In a state that is in the top 10 of economies in the world, we deserve no less than three debates.One where the Democrats choose (CNN), second for the Republicans (Fox) and the third is the winner of a coin toss called by the incumbent party (PBS). This should be policy for every governor's race. All we hear are negative accusations thrown back and forth in advertisements. We deserve to know what they stand for. Otherwise they are nothing but crooks in sheep's clothing. -- Brad Vaughn,Rancho Cucamonga","source":{"uri":"pe.com","dataType":"news","title":"The Press-Enterprise"},"authors":[],"eventUri":null,"location":null},{"uri":"965791471","lang":"eng","isDuplicate":true,"date":"2018-10-10","time":"05:21:00","dateTime":"2018-10-10T05:21:00Z","dataType":"news","sim":0,"url":"https://www.sfgate.com/news/us/article/Long-after-they-died-military-sees-surge-in-13294976.php","title":"Long after they died, military sees surge in identifications","body":"BELLEVUE, Neb. (AP) -- Nearly 77 years after repeated torpedo strikes tore into the USS Oklahoma, killing hundreds of sailors and Marines, Carrie Brown leaned over the remains of a serviceman laid out on a table in her lab and was surprised the bones still smelled of burning oil from that horrific day at Pearl Harbor.\n\nIt was a visceral reminder of the catastrophic attack that pulled the United States into World War II, and it added an intimacy to the painstaking work Brown and hundreds of others are now doing to greatly increase the number of lost American servicemen who have been identified.\n\nIt's a monumental mission that combines science, history and intuition, and it's one Brown and her colleagues have recently been completing at ramped-up speed, with identifications expected to reach 200 annually, more than triple the figures from recent years.\n\n\"There are families still carrying the torch,\" said Brown, a forensic anthropologist with the Defense POW/MIA Accounting Agency's lab near Omaha, Nebraska. \"It's just as important now as it was 77 years ago.\"\n\nOfficials believe remains of nearly half of the 83,000 unidentified service members killed in World War II and more recent wars could be identified and returned to relatives. The modern effort to identify remains started in 1973 and was primarily based in Hawaii until a second lab was opened in 2012 at Offutt Air Force Base in the Omaha suburb of Bellevue.\n\nWith an intensified push, the identifications climbed from 59 in 2013 to 183 last year and at least 200 and possibly a few more this year.\n\nThe increase has led to a surge of long-delayed memorial services and burials across the country as families and entire communities turn out to honor those killed.\n\nJoani McGinnis, of Shenandoah, Iowa, said her family is planning a service Friday at the national cemetery in Omaha now that they have finally learned what happened to her uncle, Sgt. Melvin. C. Anderson.\n\nPiecing together bits of history and DNA, the Omaha lab confirmed that remains found in 1946 in Germany were Anderson's and that he died when his tank was hit in the rugged Hurtgen Forest during a battle that lasted for months and left tens of thousands of Americans killed and wounded.\n\nBesides returning the remains, McGinnis said the agency gave her a thick file with details about how he died and how researchers unraveled the mystery.\n\n\"I wish my mom and my grandma were here to know all this information,\" said McGinnis, who recalled a framed picture of Anderson that hung in her grandmother's home in Omaha. \"My grandmother was very sad about it. She just wanted to know what happened, and she never knew.\"\n\nIn Kentucky, thousands of people lined roads for miles on a steamy August day to see a hearse carrying the remains of Army Pfc. Joe Stanton Elmore from the Nashville, Tennessee, airport to the small city of Albany.\n\nElmore was reported missing in action in December 1950 after an intense battle at the Chosin Reservoir in Korea and as deceased in 1953, but his great-niece April Speck said even decades later, her family would tell stories of \"Joe going off to war and never coming home.\" Speck said she knew her family would feel a sense of relief that his remains were finally returned, but she didn't realize what it would mean to her community.\n\n\"There were people standing out with their signs and there were retired soldiers in their uniforms saluting, and then we get into Albany and it like was a sea of people with all the American flags,\" she recalled. \"The county did an awesome job of showing respect.\"\n\nThe soaring number of identifications followed years of complaints about a cumbersome process, typically resulting in about 60 completed cases annually. Congress responded by setting a goal of 200 identifications annually, and it supported a reorganization and increased funding that saw spending climb from $80.8 million in the 2010 fiscal year to $143.9 million in 2018.\n\nThe effort now employs about 600 people.\n\nOfficials have streamlined the work of determining which remains should be disinterred. Historians focus on where clusters of servicemen died, and examine troop movements and conduct interviews with local residents.\n\n\"This work is very different from what most historians do,\" said Ian Spurgeon, an agency historian in Washington. \"This is detective history.\"\n\nSpurgeon's focus is on battles in Europe and the Mediterranean, with a goal of disinterring 50 service members annually, up from fewer than five.\n\nAt Offutt, inside a lab built in a former World War II bomber factory, bones are arranged by type on black-topped tables. In another room, buttons, fabrics, coins and other items found alongside remains are studied for hints about a service member's role or hometown.\n\nDNA is key to identifications, but it can't be extracted from all bones, and without a match from potential relatives, it has little value.\n\nIn some cases, lab workers refer to standard chest X-rays of World War II servicemen taken when they enlisted, focusing on the traits of the collarbones shown. An algorithm developed by the University of Nebraska-Omaha helps workers make comparisons of remains in minutes.\n\nFor Patricia Duran, the result has been finally learning what happened to her uncle, Army Air Forces Sgt. Alfonso O. Duran, who died in 1944 when his B-24H Liberator bomber was shot down. His remains were disinterred from a grave in Slovenia and identified this spring.\n\nDuran had for years sought information about her uncle's remains, and she said she clutched her cousin's hand while watching him be buried Aug. 22 at Santa Fe National Cemetery, about 50 miles (80 kilometers) from his childhood home in the small mountain community of El Rito, New Mexico.\n\n\"We felt such a sense of closure about it because the whole family heard the stories\" about him. \"We felt we knew Alfonso,\" she said. \"We felt he'd come home.\"\n\n___\n\nFollow Scott McFetridge on Twitter at: https://twitter.com/smcfetridge","source":{"uri":"sfgate.com","dataType":"news","title":"San Francisco Gate"},"authors":[{"uri":"associated_press@sfgate.com","name":"Associated Press","type":"author","isAgency":true},{"uri":"scott_mcfetridge@sfgate.com","name":"Scott McFETRIDGE","type":"author","isAgency":false}],"eventUri":null,"location":{"type":"place","label":{"eng":"Bellevue, Washington"},"lat":47.61038,"long":-122.20068,"country":{"type":"country","label":{"eng":"United States"},"lat":39.76,"long":-98.5}}},{"uri":"965791525","lang":"eng","isDuplicate":false,"date":"2018-10-10","time":"05:21:00","dateTime":"2018-10-10T05:21:00Z","dataType":"news","sim":0.6823529601097107,"url":"https://www.mercurynews.com/2018/10/09/taylor-swift-wins-big-at-amas-and-encourages-fans-to-vote/","title":"Taylor Swift wins big at AMAs and encourages fans to vote","body":"Taylor Swift kicked off her week with a rare political post on social media, and at the American Music Awards she continued the conversation by encouraging fans to vote in the upcoming midterm elections.\n\nSwift won four honors including artist of the year at the fan-voted show on Tuesday in Los Angeles, beating out Drake, Ed Sheeran, Imagine Dragons and Post Malone for the top prize.\n\n\"This award and every single award given out tonight were voted on by the people, and you know what else is voted on by the people,\" she said, \"the midterm elections on November 6.\"\n\nSwift announced on Sunday that she was voting for Tennessee's Democratic Senate candidate Phil Bredesen, breaking her long-standing refusal to discuss anything politics.\n\nVoting was a hot topic at the AMAs. Host and Golden Globe-winning \"black-ish\" actress Tracee Ellis Ross wore a shirt that said, \"I am a voter,\" and comedian-actor Billy Eichner told the audience, \"The biggest election of our lifetime is happening.\"\n\n\"Please grab your friends and tell them to vote. Now is the time. If you believe in equality for women, for people of color, for the LGBTQ community. If you believe that climate change is real and that we need to do something about it,\" he said onstage before presenting an award.\n\n\"And you can go to Vote.org like Taylor Swift told you to,\" he added.\n\nSwift made history by becoming the most decorated woman in the show's history with a total of 23 AMAs. Despite having the year's top-selling album and three No. 1 hits, Drake didn't win a single award. He did not attend the show but tied Cardi B with most nominations walking into the AMAs.\n\nSwift kicked off the show with a performance of \"I Did Something Bad,\" while Cardi B -- who won three honors -- picked up the night's first award, favorite hip-hop/rap artist, which she dedicated to her daughter.\n\n\"I really want to thank my daughter,\" said Cardi B, who gave birth to Kulture Kiari Cephus in July. \"I gotta prove people wrong. They said I wasn't going to make it after I had a baby.\"\n\nThe rapper hit the stage to give a festive and colorful performance of her No. 1 hit, \"I Like It,\" where she was joined by J Balvin and Bad Bunny, who was wheeled onstage inside a shopping cart. Cardi B's husband, Offset of the rap trio Migos, danced along in the audience with group member Quavo as Cardi B worked the stage with vibrant dance moves, including the salsa.\n\nCardi B returned the favor, screaming happily when Migos was named favorite pop/rock duo or group, beating out Maroon 5 and Imagine Dragons, later in the show.\n\n\"We did not know we was winning this at all,\" said Quavo, also giving a shout-out to group member Takeoff, who didn't attend the AMAs.\n\n\"I want to thank you sexy lady,\" Offset said, pointing to Cardi B.\n\nLike Cardi B's performance, rising newcomer Ella Mai also won over the crowd when she sang the year's biggest R&B hit, \"Boo'd Up,\" starting the performance as she walked down the aisle of the Microsoft Theater. Khalid, Quavo and Offset were some of the audience members dancing along, while others sang and some even filmed her with their phones.\n\nOthers who shined onstage included R&B singer Ciara, who showed off her skilled dance moves and was joined by a fierce Missy Elliott. Carrie Underwood was in perfect form vocally, and Camila Cabello -- who tied Swift with four wins -- gave a heartful, touching and vocally impressive performance of the ballad \"Consequences,\" earning her a standing ovation.\n\nThe three-hour show closed with a rousing tribute to Aretha Franklin, who died in August. Gladys Knight, Ledisi, Mary Mary, Donnie McClurkin and CeCe Winans were among the musicians who paid tribute to the Queen of Soul's gospel roots and her iconic album, \"Amazing Grace.\"\n\nRapper-singer XXXTentacion, who was fatally shot in June, was also honored: He won favorite soul/R&B album for his 2017 debut, \"17.\" It was days after he was named best new artist at the BET Hip-Hop Awards.\n\nHis mother, Cleopatra Bernard, said she was honored to accept the award on behalf of her son. \"I'm so nervous,\" Bernard said as the audience cheered her on.\n\nKane Brown swept the country categories with three wins, including male artist, album and song.\n\nPost Malone, who wore a baby blue suit and performed, won favorite pop/rock male artist, Underwood was named favorite country female artist and Khalid picked up favorite soul/R&B male artist.\n\nOther performers included Mariah Carey, Jennifer Lopez, Shawn Mendes and twenty one pilots.\n\n-- Artist of the year: Taylor Swift\n\n-- New artist of the year: Camila Cabello\n\n-- Collaboration of the year: \"Havana,\" Camila Cabello featuring Young Thug\n\n-- Favorite pop/rock female artist: Taylor Swift\n\n-- Favorite pop/rock male artist: Post Malone\n\n-- Favorite pop/rock duo or group: Migos\n\n-- Favorite pop/rock song: \"Havana,\" Camila Cabello featuring Young Thug\n\n-- Favorite pop/rock album: \"reputation,\" Taylor Swift\n\n-- Favorite rap/hip-hop artist: Cardi B\n\n-- Favorite rap/hip-hop song: \"Bodak Yellow (Money Moves),\" Cardi B\n\n-- Favorite rap/hip-hop album: \"Beerbongs & Bentleys,\" Post Malone\n\n-- Favorite soul/R&B female artist: Rihanna\n\n-- Favorite soul/R&B male artist: Khalid\n\n-- Favorite soul/R&B song: \"Finesse,\" Bruno Mars featuring Cardi B\n\n-- Favorite soul/R&B album: \"17,\" XXXTentacion\n\n-- Favorite country female artist: Carrie Underwood\n\n-- Favorite country male artist: Kane Brown\n\n-- Favorite country duo or group: Florida Georgia Line\n\n-- Favorite country song: \"Heaven,\" Kane Brown\n\n-- Favorite country album: \"Kane Brown,\" Kane Brown\n\n-- Favorite alternative rock artist: Panic! at the Disco\n\n-- Favorite adult contemporary artist: Shawn Mendes\n\n-- Favorite Latin artist: Daddy Yankee\n\n-- Favorite contemporary inspirational artist: Lauren Daigle\n\n-- Favorite electronic dance music artist: Marshmello\n\n-- Favorite social artist: BTS\n\n-- Favorite music video: \"Havana,\" Camila Cabello featuring Young Thug\n\n-- Tour of the year: Taylor Swift\n\n-- Top soundtrack: \"Black Panther: The Album, Music From And Inspired By\"","source":{"uri":"mercurynews.com","dataType":"news","title":"San Jose Mercury News"},"authors":[{"uri":"associated_press@mercurynews.com","name":"Associated Press","type":"author","isAgency":true}],"eventUri":"eng-4334218","location":null},{"uri":"965791490","lang":"eng","isDuplicate":true,"date":"2018-10-10","time":"05:21:00","dateTime":"2018-10-10T05:21:00Z","dataType":"news","sim":0,"url":"https://www.star-telegram.com/news/nation-world/national/article219768350.html","title":"Red Sox hold off Yanks in Game 4, face Astros in ALCS | Fort Worth Star-Telegram","body":"Eduardo Nunez charged Gleyber Torres' four-hopper toward third base and whipped it across the diamond. Steve Pearce stretched, falling on his chest for a sprawling catch. The umpire signaled: \"Out!\"\n\nThe Boston Red Sox gathered around exhausted closer Craig Kimbrel, hugging and celebrating after the New York Yankees' two-run rally in the ninth inning fell short.\n\nBut wait!\n\nIn 21st century baseball, the game doesn't always end when it seems, hanging in limbo until umpires in a downtown Manhattan replay room agree.\n\nA Yankee Stadium crowd of 49,641 wondered and the Red Sox watched from the infield, fixated on the center-field video board.\n\nAfter 63 seconds that felt like a lot longer, crew chief Mike Winters made it official: The Red Sox beat the Yankees 4-3 Tuesday night to win a four-game AL Division Series, setting up a postseason rematch with the World Series champion Astros.\n\n\"I've been talking about them the whole season, so now we go,\" said Red Sox rookie manager Alex Cora, Houston's bench coach last year. \"Best of seven. They know me. I know them. It should be fun.\"\n\nJ.D. Martinez and the 108-win Red Sox reached the AL Championship Series for the first time since the Red Sox won the title in 2013. A year after losing to Houston in a four-game ALDS, they will open the best-of-seven matchup against the 103-win Astros on Saturday night at Fenway Park. Houston went 4-3 against Boston this year.\n\n\"Awesome to clinch this one,\" Red Sox reliever Matt Barnes said, \"but we've got eight more.\"\n\nA New Jersey native who grew up a Mets fan, Rick Porcello held the Yankees to one run over five innings for his first postseason win. Barnes and Ryan Brasier followed with a perfect inning each to protect a 4-1 lead. Red Sox ace Chris Sale followed with a 1-2-3 eighth in a rare relief appearance, extending a string of 11 straight outs for Boston pitching.\n\nNew York had not put a leadoff runner on until Kimbrel, a seven-time All-Star closer, walked Aaron Judge on four pitches leading off the ninth.\n\nDidi Gregorius singled and Giancarlo Stanton struck out, dropping to 4 for 18 (.222) with no RBIs in the series. Luke Voit walked on four pitches, and Kimbrel hit Neil Walker on a leg with his next pitch, forcing in a run.\n\nGary Sanchez fell behind 0-2 in the count, worked it full and sent a drive that had the crowd roaring only for Andrew Benintendi to catch it on the left-field warning track, a few feet short of a game-ending grand slam.\n\n\"I hit it well. But I got under it,\" Sanchez said through a translator.\n\nThen came Torres' bouncer.\n\n\"I think we're right there knocking on the door,\" Yankees rookie manager Aaron Boone said, \"very close to being a championship club right now. We just got to continue to improve on the margins in every facet. Pitching is one of those.\"\n\nA night after Boston romped to a record-setting 16-1 rout in a game that included three replay reversals, Martinez, Ian Kinsler and Nunez drove in runs in the third inning off a wobbly CC Sabathia. For the second straight night, Boone hesitated to remove his starting pitcher early.\n\nWhen Boone brought in Zach Britton to start the fourth, Vazquez led off with an opposite-field drive over the short porch in right field for his first career postseason homer.\n\nNot even the presence of 1978 AL East tiebreaker star Bucky Dent for the ceremonial first pitch could inspire the 100-win Yankees, who were outscored 27-14 in the series, including 20-4 in the final two games. New York set a major league record this year for most home runs in a season, but didn't go deep in the two games at Yankee Stadium.\n\nDent's home run over Fenway Park's Green Monster in the 1978 AL East tiebreaker propelled the Yankees to their second straight World Series title, but Boston eliminated its rival in the Bronx in the teams' second straight postseason meeting. In the 2004 ALCS -- with Barnes in the crowd as a teen, rooting for the Yankees -- the Red Sox became the first big league team to overcome 3-0 postseason deficit, winning the final two games on the road and going on to sweep the World Series for its first title since 1918.\n\nBoston added championships in 2007 and 2013, becoming one of baseball's elite clubs. But the Red Sox had been knocked out in the Division Series the previous two years and had not reached the sport's final four since their last title.\n\nA lanky, bearded 29-year-old right-hander, Porcello lived a traffic jam from Yankee Stadium in Chester, New Jersey, and is a 2007 graduate of Seton Hall Prep in West Orange -- the baseball field there was renamed in his honor last year after he helped fund artificial turf and pro-style dugouts. The 2016 AL Cy Young Award winner entered with a 0-3 in 12 previous postseason appearances, which included four starts.\n\nNew York got its first run on Brett Gardner's sacrifice fly in the fifth. Aaron Hicks missed a home run by about 4 feet on a foul drive down the right-field line, worked the count full, then popped out to Kinsler to backpedaled from second to short right field.\n\nSabathia, a 38-year-old lefty who led the Yankees to their last World Series title in 2009, had been the slide-ender of New York's pitching staff with a 14-1 record following losses in the previous two regular seasons.\n\nPitching on 11 days' rest and perhaps for the final time in pinstripes, Sabathia escaped a bases-loaded jam in the first when Kinsler hit an inning-ending flyout to Gardner in front of the left-field wall.\n\nHe needed 35 pitches to get through two innings and nicked Benintendi on the right shoulder with a slider on his first pitch of the third. Steve Pearce sliced a cutter into right-center to put runners at the corners and Martinez hit a third-inning sacrifice fly for second straight night, giving him six RBIs in the series.\n\nXander Bogaerts advanced Pearce with a comebacker and, with David Robertson starting to warm up, Sabathia threw a wild pitch on a cross-up with Sanchez.\n\nKinsler doubled over a leaping Gardner for a 2-0 lead and Nunez singled on the next pitch for his first RBI of the postseason.\n\nBEHIND THE PLATE\n\nA night after three of his calls at first base were reversed on video reviews, Angel Hernandez called balls and strikes. Benintendi argued after he was called out on a breaking ball with the bases loaded for the final out of the eighth, a pitch that may have been outside. Sabathia said the umpire should not be allowed to work any more postseason games.","source":{"uri":"star-telegram.com","dataType":"news","title":"star-telegram"},"authors":[],"eventUri":null,"location":null}