{
  "uri": "965791517",
  "lang": "eng",
  "isDuplicate": false,
  "date": "2018-10-10",
  "time": "05:21:00",
  "dateTime": "2018-10-10T05:21:00Z",
  "dataType": "news",
  "sim": 0,
  "url": "https://gantdaily.com/2018/10/10/dubois-city-parking-ordinance-tops-council-meeting/",
  "title": "DuBois City Parking Ordinance Tops Council Meeting",
  "body": "DUBOIS - On Oct. 1, DuBois City officials began re-enforcing an existing ordinance, which prohibits parking between the road and sidewalk.\n\nAt Monday night's regular council meeting, area residents showed up to complain, some with their tickets in-hand.\n\nCouncil members indicated they would explore other solutions in order to balance enforcement and the adverse impact on residents.\n\nAccording to previously-published GANT News reports, the ordinance's enforcement was driven by two issues with the first being to keep the city \"visually attractive.\"\n\nSecondly, city officials have cited its necessary for safety reasons because at some intersections, vehicles were being parked in the right-of-way, which made it difficult to see oncoming traffic.\n\nInitially, city officials' suggested solutions encompassed having residents either park on- or off-the-street properly as permitted under the ordinance.\n\nHowever, on-street parking was protested for a number of reasons. Most importantly, it was noted if vehicles were parked along both sides, then emergency vehicles wouldn't be able to pass through.\n\nIn addition, officials pointed out that sometimes it becomes necessary to remove vehicles from streets in order to clear a passageway for street cleaners, snow plows, etc.\n\nSome residents advised city officials that for age and health reasons, it's already difficult enough to move their vehicles and walk back to their homes.\n\nCity officials have also suggested that residents use or create a parking space on their properties that would be permitted under the ordinance.\n\nThis, residents protested, could possibly harm their yards, if they even had the space.\n\nIt was suggested for residents to park off the alleyway, which aroused concerns that an alley could be considered a roadway under the existing ordinance.\n\nSolicitor Toni Cherry said she would look into the ordinance to confirm that it wouldn't and if it did, she suggested that it could be revised by the city.\n\nRobert Little, who has a real estate background, commented: \"It is really going to affect the property values here in the city.\" He also warned it's not easy to sell homes that don't have off-street parking.\n\nLittle showed council members photographs of his own home to demonstrate the inability to park at his property without parallel, off-street parking.",
  "source": {
    "uri": "gantdaily.com",
    "dataType": "news",
    "title": "Clearfield Gant Daily"
  },
  "authors": [
    {
      "uri": "steven_mcdole@gantdaily.com",
      "name": "Steven McDole",
      "type": "author",
      "isAgency": false
    }
  ],
  "eventUri": null,
  "location": null
}
