{"uri":"965788613","lang":"eng","isDuplicate":false,"date":"2018-10-10","time":"05:15:00","dateTime":"2018-10-10T05:15:00Z","dataType":"news","sim":0,"url":"https://www.bloombergquint.com/pursuits/travelers-spend-more-money-in-thailand-than-anywhere-else-in-asia","title":"Travelers Spend More Money in Thailand Than Anywhere Else in Asia","body":"(Bloomberg) -- Just more than a year ago, I ate at Nahm, in Bangkok -- and walked out after paying barely $60 for a tasting menu that currently ranks 49th on the World's 50 Best Restaurants list. My grand, five-star hotel, the Anantara Siam, with its gilded murals and landscaped courtyards, cost $150 a night, including a breakfast buffet that was truly fit for royalty. Even the most expensive souvenir I bought in town, an elephant figurine with inlaid mother of pearl, cost less than a typical outing to McDonald's back home in New York.","source":{"uri":"bloombergquint.com","dataType":"news","title":"Bloomberg Quint"},"authors":[{"uri":"nikki_ekstein@bloombergquint.com","name":"Nikki Ekstein","type":"author","isAgency":false}],"eventUri":null,"location":null}{"uri":"965788550","lang":"eng","isDuplicate":false,"date":"2018-10-10","time":"05:15:00","dateTime":"2018-10-10T05:15:00Z","dataType":"news","sim":0,"url":"http://www.sentinelandenterprise.com/breakingnews/ci_32195221/higgins-palmieri-square-off-at-leominster-high-debate","title":"Higgins, Palmieri square off at Leominster High debate","body":"LEOMINSTER -- Tuesday's student-organized and education-focused debate at Leominster High School saw incumbent state Rep. Natalie Higgins and Republican challenger Rich Palmieri agree on many public education issues but diverge on how to fund these initiatives they both say are important in local schools.\n\nHiggins and Palmieri were both adamant in their desire to alter the state's public education funding formula in a way that would divert more money to communities like Leominster. They both said they were opposed to high-stakes testing and the idea of arming teachers to keep schools safer.\n\n\"The funny thing is, I don't think our views on a majority of this stuff are different,\" Palmieri remarked after the debate. \"I really do believe fundamentally we want the same thing: a good education for children.\"\n\nHiggins also acknowledged her and Palmieri's similar viewpoints, but did point out one crucial difference.\n\n\"There's a lot of agreement, but the place we often disagree on is how to pay for it,\" she said. \"I hear Rich say over and over again 'unfunded mandate, unfunded mandate,' but when the question came for how do you pay for it, he actually never gave an answer.\"\n\nIndeed, the phrase unfunded mandate, which are state-ordered educational requirements schools have to follow but aren't given additional funding to pay for, was recurring theme in Palmieri's answers to the nine questions he was asked Tuesday, as well as several follow-up questions from the student moderators.\n\nHe referenced them when answering a question about eliminating the MCAS as a graduation requirement and later blamed such mandates in three subsequent questions, saying they had prevented Leominster schools from having the money to offer more foreign language and civics classes and alternative learning environments for students.\n\nThough he said he was in favor of making sure students had more access to such programming, and the even more expensive task of amending the state's public education funding formula, Palmieri offered little explanation as to how he thought this should all be paid for.\n\nWhen asked what steps she would take to reform educational funding in the state, Higgins mentioned the proposed Faire Share Amendment, which Democrats estimate would generate an additional $1 billion for public schools by putting a 4 percent surtax on incomes over $1 million.\n\nPalmieiri warned against the amendment, saying that it could later be elevated to as much as 10 percent by legislators without any input from the public.\n\n\"It's not the right way to go about it,\" he said. \"We need to bring in revenue, we need to bring in money, but we can't target tax. It doesn't work.\"\n\nHiggins would later remark after the debate that there are alternative ways for the state to bring in new money like the proposed 1 percent tax on college endowments over $1 billion that Higgins said would raise $550 million for the state.\n\n\"We have alternatives that aren't going to put pressures on middle class families, working class families, or seniors,\" she said. \"We could talk about other cool loopholes I would like to close, like how in Massachusetts you don't pay taxes when you buy an airplane but you pay taxes when you buy a car. Who's benefiting from that? No one in Leominster.\"\n\nThe debate, which was almost solely attended by members of the high school's senior class, ran for about an hour and did give some students of voting age a better idea of who they plan to support at the polls next month.\n\nLHS senior Teddy Housser said he thought Higgins had been more prepared for the debate, but plans to vote for Palmieri.\n\n\"She seemed more ready, but I thought his arguments related to me better,\" he said. \"It wasn't anything in particular, but I did think a lot of her arguments were well put-together.\"\n\nFellow senior Robert Davis said he's not old enough to vote yet, but said he thought Higgins had performed the strongest.\n\n\"I feel like Natalie Higgins looked more prepared to answer these questions, but with the last one about whether teachers should have guns, I thought Mr. Palmieri's answer was more in-depth,\" said Davis.\n\nFollow Peter Jasinski on Twitter @PeterJasinski53","source":{"uri":"sentinelandenterprise.com","dataType":"news","title":"Fitchburg Sentinel & Enterprise"},"authors":[],"eventUri":null,"location":{"type":"place","label":{"eng":"Leominster"},"lat":52.22583,"long":-2.74491,"country":{"type":"country","label":{"eng":"United Kingdom"},"lat":54.75844,"long":-2.69531}}}{"uri":"965787871","lang":"spa","isDuplicate":false,"date":"2018-10-10","time":"05:14:00","dateTime":"2018-10-10T05:14:00Z","dataType":"news","sim":0,"url":"https://laopinion.com/2018/10/10/amas-2018-alfombra-roja-y-ganadores-de-la-noche/","title":"AMAs 2018: Alfombra roja y ganadores de la noche | La Opinión","body":"Mira a los famosos que más llamaron la atención, ya sea para bien o para mal\n\nLas estrellas más populares de la cultura pop actual desfilaron anoche por la tradicional alfombra roja de la 46 edición de los American Music Awards (AMAs), entregados en el Microsoft Theater de Los Ángeles, California.\n\nEntre las celebridades que más llamaron la atención, ya sea para bien o para mal, fueron:\n\nTaylor Swift sorprendió con su vestido inspirado en una bola de discoteca.\n\nJennifer López lució radiante y muy sexy con un escotadísimo vestido rosa.\n\nCamila Cabello no destacó gracias a que su vestimenta consistía en un corset negro y un pantalón del mismo tono que no fue del agrado de muchos.\n\nArtista Masculino de Pop/Rock Favorito del Año: Post Malone.\n\nDúo o Grupo de Rock/Pop Favorito: Migos.\n\nÁlbum de Pop/Rock Favorito: Reputation, de Taylor Swift.\n\nCanción Pop/Rock Favorita: \"Havana\", de Camila Cabello.\n\nArtista de Country Masculino Favorito: Kane Brown.\n\nArtista de Country Femenina Favorita: Carrie Underwood.\n\nArtista Adulto Contemporáneo Favorito: Shawn Mendes.","source":{"uri":"laopinion.com","dataType":"news","title":"La Opinión"},"authors":[{"uri":"jose_antonio_castaneda@laopinion.com","name":"José Antonio Castañeda","type":"author","isAgency":false}],"eventUri":null,"location":null}{"uri":"965788553","lang":"eng","isDuplicate":false,"date":"2018-10-10","time":"05:15:00","dateTime":"2018-10-10T05:15:00Z","dataType":"news","sim":0,"url":"http://www.egypttoday.com/Article/8/58697/Mourinho-has-backing-of-Man-United-fans-and-club-says","title":"Mourinho has backing of Man United fans and club, says Moyes","body":"Former Manchester United boss David Moyes believes current manager Jose Mourinho (pictured) still has the backing of the club and its fans AFP/File / Lindsey PARNABY Former Manchester United manager David Moyes believes Jose Mourinho retains the full backing of the club and their supporters despite a poor start to the Premier League season.\n\nMourinho reportedly faced the sack regardless of the outcome of Saturday's fixture with Newcastle but is still in position after the team roared back to win 3-2 after trailing 2-0.\n\nMoyes, who succeeded Alex Ferguson in 2013, was dumped by United while in the first year of a six-year contract and his replacement, Louis van Gaal, was axed after winning the FA Cup.\n\nBut the former Everton boss said he believed United would give Mourinho time even though they are languishing in eighth spot in the Premier League.\n\n\"I think the club are firmly behind the manager, and he's been a winner, Jose, throughout his career, so I don't see why that should suddenly change,\" the Scot, 55, told Britain's Press Association.\n\n\"It was a great result -- any team that comes from 2-0 down. But the one thing that happens at Old Trafford is the crowd gets right behind you, and is always supportive of the manager and the players.\"\n\nDerby manager Frank Lampard, who recently masterminded a League Cup victory at Old Trafford and played under Mourinho at Chelsea, believes that after Saturday's comeback the onus should be on the players to raise their standards.\n\n\"Sometimes things are hard and you have to make difficult decisions, try and influence people around you, influence your players to try and get the best out of them,\" he said. \"I think he's got all those attributes so I hope that it turns around for him.\"\n\nFormer United captain Wayne Rooney, who now plays in the United States, has also called on the players to stand up and be counted, saying Mourinho is an easy target.\n\n\"The players, the manager, it has been a tough start to the season,\" the D.C. United player said in comments reported by Britain's Daily Telegraph newspaper.\n\n\"I know Jose is getting a load of stick but I said a few weeks ago, the players have to stand up. They have to be counted and they have to be better.\"","source":{"uri":"egypttoday.com","dataType":"news","title":"Egypt Today"},"authors":[],"eventUri":null,"location":null}{"uri":"965788487","lang":"eng","isDuplicate":false,"date":"2018-10-10","time":"05:15:00","dateTime":"2018-10-10T05:15:00Z","dataType":"news","sim":0.729411780834198,"url":"https://www.dcourier.com/news/2018/oct/09/calendar-events-oct-10-13/","title":"Calendar of Events:  Oct. 10-13","body":"Skull Valley community cleanup, 8 a.m. to 4 p.m., Skull Valley Transfer Station, 12970 West Van Dickson Road, north of Skull Valley, on the west side of Iron Springs Road, near railroad underpass. Open to Yavapai County residents for no charge. 928-771-3183.\n\n\"Singing in the key of life,\" 10 to 11:30 a.m., Prescott United Methodist Church, Deborah Room, 505 W. Gurley St., Prescott. This group is focused on people 60 and older. No special talent required. 928-445-5211, ext. 2605 or 2601, or seniorpeerprogram.org.\n\nPeople Who Care Volunteer Informational Meeting, 1:30 to 3:30 p.m., People Who Care Office, Prescott United Methodist Church, 505 W. Gurley, 928-445-2480.\n\nWriting Workshop Series: Schematic Order, 2 p.m., Prescott Public Library, 215 E. Goodwin St. Register online, at the Ask a Librarian Desk or call 928-777-1526.\n\nModern Board Gaming, 4 p.m., Prescott Public Library, 215 E. Goodwin St. 928-592-5699.\n\nBeginners Conversational French, 4 to 5 p.m., Prescott Valley Public Library, 7401 E Civic Circle, Glassford Hill Room.\n\nSedona Film Festival presents \"Living in the Future's Past,\" 4 and 7 p.m., Mary D. Fisher Theatre, 2030 W. Highway 89A, Tickets are $12 or $9 for film festival members. 928-282-1177.\n\nVFW Post 541 Surprise Dinner, 4:30 to 7 p.m., 202 N. Arizona Ave, Prescott. 928-776-1125.\n\nTown Hall with Supervisor Brown and Yavapai County departments, 6 to 7:30 p.m., Coyote Springs, 6325 Baja Circle, Prescott Valley. 928-442-5132 or Web.bos.district4@yavapai.us.\n\nJUSTFAITH, 6 to 8 p.m., Unity of Prescott, 145 S. Arizona Avenue. This program explores faith-based roots of social justice and how one person can effectively respond to the needs of today's world. 928-308-0271 or 602-509-9639.\n\nNDE (Near Death Experiences) stories shared and explored, 6:15 to 7:30 p.m., Prescott Public Library, Elsie Room, 215 E. Goodwin St. We will be reviewing NDE accounts as this can bring new meaning and direction to your life. Facilitated by Karl Krumins and friends.\n\nMovies at the Elks -- \"Beetlejuice,\" 7 p.m. Elks Theatre and Performing Arts Center, 117 E. Gurley St. Admission is a cash donation of any amount.\n\nThursday, Oct. 11\n\nJUSTFAITH, 9 to 11 a.m., Library at United Methodist Church, 505 W. Gurley St. This program explores faith-based roots of social justice and how one person can effectively respond to the needs of today's world. 928-778-1950 or 602-509-9639.\n\nYou Too Mentor! 10 or 11 a.m., Prescott Public Library, 215 E. Goodwin St. Training on iPads with hearing and vision accessibility apps. To register, contact the Ask a Librarian Desk at 928-777-1526 or ask.librarian@prescott-az.gov.\n\nFree Blood Pressure Checks By Darcey of Glassford Place, 10:30 to 11:30 a.m., CASA Senior Center - PV Active Adult Center, 9360 E. Manzanita Circle. 928-772-3337.\n\nBeginning Meditation & Mindfulness, 11 a.m. to noon, Prescott Valley Public Library, 7401 E Civic Circle, Genealogy Room.\n\n\"Dog Talk\" w/Lucy Reynolds, noon, CASA Senior Center - PV Active Adult Center, 9360 E. Manzanita Circle. Come enjoy lunch & stay for presentation re: de-mystifying canine behavior. 928-772-3337.\n\nGenealogy Mentor Session, 1 or 2 p.m., Prescott Public Library, 215 E. Goodwin St. Register online, at the Ask a Librarian Desk or call 928-777-1526.\n\nChino Valley Farmers Market, 3 to 6 p.m., Olsen's Grain, 344 S Highway 89, Chino Valley.\n\nSedona Film Festival presents \"Living in the Future's Past,\" 4 and 7 p.m., Mary D. Fisher Theatre, 2030 W. Highway 89A, Tickets are $12 or $9 for film festival members. 928-282-1177.\n\nNational Theatre Live Broadcast - \"Julie,\" via satellite broadcast, 6 p.m., Yavapai College Performing Arts Center, 1100 E. Sheldon St. Tickets are $15 for adults, $10 for youth.\n\nTown Hall with Supervisor Brown and Yavapai County departments, 6 to 7 p.m., 1015 Fair Street, Prescott. 928-442-5132 or Web.bos.district4@yavapai.us.\n\nAlzheimer's Presentation-Dementia Conversations, 6 to 7:30 p.m., Prescott Valley Public Library, 7401 E Civic Circle, Crystal Room. Pvlib.net.\n\nWORDS Book Club, 6:30 p.m., Prescott Public Library, 215 E. Goodwin St. \"The Handmaid's Tale.\"\n\nFriday, Oct. 12\n\nLapsit Storytime, 9:30 a.m., Prescott Public Library, 215 E. Goodwin St.\n\nReally Basic Computer Class! 10 a.m., Prescott Public Library, 215 E. Goodwin St. Register online, at the Ask a Librarian Desk or call 928-777-1526.\n\nConversational Spanish, 10 a.m., Prescott Public Library, 215 E. Goodwin St.\n\nGreeting Card Workshop, 10 to 11 a.m., CASA Senior Center - PV Active Adult Center, 9360 E. Manzanita Circle. 928-772-3337.\n\nHistoric Downtown Walking Tours \"Where It All Began,\" 10 a.m., Chamber's Visitor Information Center, 117 W. Goodwin St. 928-445-2000 or www.prescott.org.\n\nSenior Connection's \"Senior & Caregivers Conference & Expo,\" 10 a.m. to 3 p.m., Liberty Traditional School, 3300 N Lake Valley Road, Prescott Valley. More than 60 providers of senior products and services, and presentations by local experts throughout the day. Free admission. www.SeniorConnection.us or 928-778-3747.\n\nGranite Mountain Interagency Hotshot Crew (GMIHC) Learning and Tribute Center, 10 a.m. to 4 p.m., Prescott Gateway Mall, #120 (near Dillard's). www.gmihc19.org. info@gmihc19.org. www.facebook.com/gmihc19.\n\nPreschool Storytime, 10:30 a.m., Prescott Public Library, 215 E. Goodwin St.\n\nArt Day for Kids, 1 p.m., Prescott Public Library, 215 E. Goodwin St. For ages 6014. Register online, at the Youth Desk or call 928-777-1537.\n\nPony Canasta, 1 to 4 p.m., CASA Senior Center - PV Active Adult Center, 9360 E. Manzanita Circle. 928-772-3337.\n\nBig Sting - It's a Country Thing Country Music Festival, music begins at 3 p.m. Watson Lake, 1500 E. Highway 69. Tickets are $25 for a single day pass and $50 for a two-day pass, parking is $5 per vehicle per day. www.thebigsting.com.\n\nAnnual Oktoberfest, 4 to 6:30 p.m., Mt. of Faith Lutheran Church, 20135 E Stagecoach Trail, Cordes Lakes. Enjoy live music from \"The Sidekicks\" band, a German meal, door prizes, raffle items, and a White elephant sale.\n\nDinner: adults $7 and children $3. Proceeds will benefit Mayer Meals on Wheels, and the beautification of MOF.\n\nAll-you-can-eat Fish Fry $9/Shrimp $11, 4:30 to 7 p.m., VFW-Buckey O'Neill Post 541, 202 N Arizona Ave.\n\nFriday Fish Fry, 5 to 7 p.m., American Legion Post 78, 3301 Highway 69, Humboldt.\n\n\"Agni Yoga: Education for the Soul,\" 7 to 8 p.m., WMEA Izvara Center, 1720 West McIntosh Drive, Prescott. RSVP at 928-778-0638 or staff@wmea-world.org.\n\n\"Cruisin' - The Music of Smokey Robinson, 7 p.m. Elks Theatre and Performing Arts Center, 117 E. Gurley St. Tickets are $25 for adults, $22 for seniors and $30 for opera box seats and can be purchased online at www.prescottelkstheater.com, by calling 928-777-1370 or at the door one hour prior to the performance.\n\nSaturday, Oct. 13\n\nPrescott Farmer's Market (PFM), 7:30 a.m. until noon, Yavapai College, 1100 E. Sheldon St. www.prescottfarmersmarket.org.\n\nSkull Valley community cleanup, 8 a.m. to 4 p.m., Skull Valley Transfer Station, 12970 West Van Dickson Road, north of Skull Valley, on the west side of Iron Springs Road, near railroad underpass. Open to Yavapai County residents for no charge. 928-771-3183.\n\nNaturalist Walks, 8:30 a.m., Highlands Center for Natural History, James Learning Center entrance, 1375 S. Walker Road, Prescott.\n\nBreakfast with the Animals: Gray Wolf, 9 a.m., Heritage Park Zoo, 1403 Heritage Park Road, preregistration is required, Admission for Heritage Park Members is $20 for adults and $10 for children 12 and under, admission for non-members is $25 for adults and $15 for children 12 and under. 928-778-4242.\n\nTar and Trail MC Ride Prescott to Congress, 9 a.m. to 3 p.m., VFW Post 541, 202 N. Arizona Ave. to Arrowhead Bar and Grill in Congress.\n\nCrossroads of the West Gun Show, 9 a.m. to 5 p.m. Prescott Valley Event Center, 3201 N. Main St. $10 at the door good for both days, kids 12 and under are free with a paid adult.\n\nHistoric Downtown Walking Tours \"Where It All Began,\" 10 a.m., Chamber's Visitor Information Center, 117 W. Goodwin St. 928-445-2000 or www.prescott.org.\n\nPrescott Mac User Group (PMUG) monthly meeting, 10 a.m., Yavapai College, Building 4, Room 102. This month's topics include iOS 12, Apple Watch and the Mohave update. Non-members are welcome. www.pmug.us.\n\nCome birding with CALT, 10 a.m. to noon, Flume Trail in the Granite Dells. Bring your binoculars. Please RSVP by email: calt@centralazlandtrust.org. http://www.centralazlandtrust.org.\n\nEcological Water in Arizona: Sustaining Our Rivers and Springs, Speakers from Citizens Water Advocacy Group, Sierra Club, Tucson Audubon, and Yavapai Apache Nation, 10 a.m. to noon, Granite Peak Unitarian Universalist Congregation building, 882 Sunset Ave., Prescott. 928-445-4218; www.cwagaz.org.\n\nGranite Mountain Interagency Hotshot Crew (GMIHC) Learning and Tribute Center, 10 a.m. to 4 p.m., Prescott Gateway Mall, #120 (near Dillard's). www.gmihc19.org. info@gmihc19.org. www.facebook.com/gmihc19.\n\nArcosanti Bluegrass Festival, 10 a.m.-7 p.m., Arcosanti, 13555 S. Cross L. Road, $12 for adults for 2-day performances, free for youth 16 years and under, $5 for breakfast, $12 for lunch, $12 for dinner, camping is $5 per person per night, 928-632-6225.\n\nFamily Storytime, 11 a.m., Prescott Public Library, 215 E. Goodwin St.\n\n\"Who is Arizona's Independent Voter?\" noon to 2 p.m. Yavapai College, 1100 E. Sheldon St., Prescott, building 3, Room 119.\n\nYavapai Flute Circle, noon to 2:30 p.m., Prescott Valley Public Library, Children's Program Room, 7401 E Civic Circle. 717-1000.\n\nBig Sting - It's a Country Thing Country Music Festival, music begins at 1 p.m. Watson Lake, 1500 E. Highway 69. Tickets are $25 for a single day pass and $50 for a two-day pass, parking is $5 per vehicle per day. www.thebigsting.com.\n\nAsk the Angels, 1 to 2:30 p.m., Elks Performing Arts Center, 117 E. Gurley St., 2nd Floor Dance Studio 2, Prescott. Practical angel messages for all attending. $10 donation. Reservations required. Seating limited. 928-772-6826.\n\nCandace Devine, 7 p.m., Elks Theatre and Performing Arts Center, 117 E. Gurley St. Tickets are $30 for adults, $20 for seniors and $40 for opera box seats and can be purchased online at www.prescottelkstheater.com, by calling 928-777-1370 or at the door one hour prior to the performance.\n\nDon Felder, Formerly of the Eagles, 7:30 to 9:30 p.m., Yavapai College Performing Arts Center, 1100 E. Sheldon St., Prescott. A former lead guitarist of The Eagles - whose iconic riffs can be heard on \"One of These Nights,\" \"New Kid in Town,\" and the Grammy-studded \"Hotel California\" - brings his legendary skills and rock 'n roll repertoire to the Prescott stage.","source":{"uri":"dcourier.com","dataType":"news","title":"dcourier"},"authors":[],"eventUri":"eng-4333776","location":{"type":"place","label":{"eng":"Skull Valley, Arizona"},"lat":34.5053,"long":-112.68545,"country":{"type":"country","label":{"eng":"United States"},"lat":39.76,"long":-98.5}}}{"uri":"965788473","lang":"eng","isDuplicate":false,"date":"2018-10-10","time":"05:15:00","dateTime":"2018-10-10T05:15:00Z","dataType":"news","sim":0,"url":"https://www.zdnet.com/article/my-health-record-justifications-kind-of-lame-godwin/","title":"My Health Record justifications 'kind of lame': Godwin | ZDNet","body":"Lawyer and writer Mike Godwin is one of America's most prominent commentators on digital policy. Recently, he spent more than a month researching Australia's controversial My Health Record and its background. He didn't like what he found.\n\n\"The benefits are not clear. On the one hand, it seems to be billions of Australian dollars spent for nothing really useful, and on the other hand it seems very privacy invasive,\" Godwin told ZDNet last week.\n\n\"If you don't want anyone associated with any healthcare organisation you ever connect to, or with government generally, looking at your health records over some long period of time, you ought to opt out now.\"\n\nGodwin thinks the government has done \"a very poor job\" of justifying My Health Record. In the last couple of months of the opt-out window, at least, it's been trying to \"propagandise\" for the centralised digital health record system.\n\n\"Honestly, from my perspective, even the best-case stories of My Health Record are kind of lame,\" he said.\n\n\"If everybody had to carry around a shopping cart full of their health records for every visit to the doctor then you might have a case, but that doesn't seem to be a problem for most Australians.\"\n\nGodwin summarised his research in a 2200-word article for Slate in August.\n\n\"If you want the tl;dr version of it, it's 'Don't sign up. Opt out.' If you forget everything else I've said here, just opt out. You can opt in later, but you need to opt out now before November 15.\"\n\nGodwin has also been tracking the progress of the Assistance and Access Bill, the Australian government's proposed legislation to tackle the problems that end-to-end encrypted messaging are posing for law enforcement.\n\nThe government has been eager to hose down concerns that the new laws would force vendors to build backdoors into encrypted communications. But some experts say it merely relocates the backdoors, and a new coalition of industry, technology, and human rights groups has formed to fight the legislation.\n\nGodwin says the government does understand the concerns, which is why the legislation is written the way it is.\n\n\"The government actually is aware that if they said outright what they really want, that you wouldn't like it. And so what they do is, they've mushed it up a little bit by saying we're not going to mandate stuff. We're not going to require Apple or Samsung to build in insecurity, except that we maybe will,\" he said.\n\n\"If you read through the legislation, you find that the exceptions eat the rule, eat the declared good intent.\"\n\nAccording to Godwin, there's nothing new here in the governmental push for more power, but that the digital world has changed the balance.\n\n\"For almost all of human history, it's been impossible for governments or police agencies to know everything that was happening with you privately. If you wanted to have a private conversation with your mate, you would just walk down the road and be out of earshot ... if you didn't want to be seen talking to him, you could walk around the bend of the road so you were not visible.\n\n\"But now, because so much of our lives is digital and online, that is a real treasure trove, potentially not just for police agencies but also for any government administrative agency, for intelligence agencies. They want to build that snooper ability into your devices, and that seems inhumane, wrong, anti-democratic,\" he said.\n\n\"The nature of democracies is that they rely on the idea of limits to what government can do, and you can't abandon that. You have to stick with that, even if it's uncomfortable, because you can't capture every bad guy because you can break into his iPhone.\"\n\nAustralian industry and tech groups unite to fight encryption-busting Bill\n\nThe new mega-group has called on Canberra to ditch its push to force technology companies to help break into their own systems.\n\nEncryption Bill sent to joint committee with three week submission window\n\nFresh from rushing the legislation into Parliament, the government will ram its legislation through the Parliamentary Joint Committee on Intelligence and Security.\n\nHome Affairs makes changes to encryption Bill without addressing main concerns\n\nServices providers now have a defence to use if they are required to violate the law of another nation, and the public revenue protection clause has been removed.\n\nAustralia's anti-encryption law will merely relocate the backdoors: Expert\n\nIf the Assistance and Access Bill becomes law as it stands, it could affect 'every website that is accessible from Australia' with relatively few constraints in the government's powers.\n\nInternet Architecture Board warns Australian encryption-busting laws could fragment the internet\n\nIndustry groups, associations, and people that know what they are talking about, line up to warn of drawbacks from Canberra's proposed Assistance and Access Bill.\n\nDespite risks, only 38% of CEOs are highly engaged in cybersecurity (TechRepublic)\n\nBusiness leaders believe AI and IoT will seriously impact their security plan, but they're unsure how to invest resources to defend against new threats.\n\n5 tips to secure your supply chain from cyberattacks (TechRepublic)\n\nIt's nearly impossible to secure supply chains from attacks like the alleged Chinese chip hack that was reported last week. But here are some tips to protect your company.\n\nIT staff systems/data access policy (Tech Pro Research)\n\nIT pros typically have access to company servers, network devices, and data so they can perform their jobs. However, that access entails risk, including exposure of confidential information.","source":{"uri":"zdnet.com","dataType":"news","title":"ZDNet"},"authors":[],"eventUri":null,"location":null}{"uri":"965788514","lang":"eng","isDuplicate":false,"date":"2018-10-10","time":"05:15:00","dateTime":"2018-10-10T05:15:00Z","dataType":"news","sim":0,"url":"https://www.cnn.com/2018/10/10/politics/trump-midterms-travel-final-four-weeks-strategy/index.html","title":"'Trump people to death': GOP hopes President holds key to 2018","body":"Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds.\n\n(CNN)President Donald Trump has stacked his schedule with campaign events with just four weeks until Election Day, hopscotching from state-to-DC-to-state to tout Republican lawmakers and slam their opponents.\n\nAfter rallying in Iowa on Tuesday night, Trump heads to Pennsylvania on Wednesday and Ohio on Friday before wrapping up his week of campaign travel in Kentucky on Saturday.The uptick in the President's schedule is part of a strategy top national Republican operatives hope will prevent a blue wave from crashing in November: Using the President, particularly in traditionally red states he won in 2016, to \"Trump people to death,\" as one operative put it. National Republicans believe frequent trips from Trump should be able to accentuate those state's natural political bent and overcome a national atmosphere that appears to favor Democrats.This could be particularly key to holding the Senate, the two GOP operatives said, where Democrats have been left to defend blue seats in red states. Read MoreTrump visits to Montana, North Dakota, West Virginia and Tennessee -- all states he's already recently campaigned in -- are examples of how the President reminds Republican voters that even though his name is not on the ballot, his ability to get things done is, the operatives said.\"Pretend I'm on the ballot,\" Trump said at a recent rally.The House is differentThe thinking is slightly different in the fight for the House, where much of the Democratic expansion is being fought in more swing and lean Republican suburban districts, where Trump's style and policies have left the President less popular than he is in other parts of the country.But Republicans tasked with protecting House majorities in November believe the President can stop Democrats on offense in Kansas, Minnesota and certain parts of Ohio.\"We think we will be able to Trump people to death,\" said one Republican operative, speaking about the President's ability to excite his base of supporters. \"To his voters, he is the only credible messenger.\"Republicans are well aware that their ability to protect majorities in the House and Senate will be viewed as a direct reflection of the country's view of the President. Democrats are animated at levels unseen in past midterm elections, according to recent polling, and many believe the midterms are their best chance to deliver a stinging rebuke to Trump.That became clear over the last few weeks during the debate over Supreme Court Justice Brett Kavanaugh, whose nomination fight grew incredibly contentious after he faced a sexual assault allegation. Kavanaugh denied that allegation and one of sexual misconduct, in a testy hearing on Capitol Hill. But the treatment of his accuser, Christine Blasey Ford, who also testified before the Senate panel, and the subsequent Senate approval of Kavanaugh angered Democrats.Republicans hope, though, that their base will be motivated by a feeling that Kavanaugh was unfairly treated by the media and Democrats, something Trump is expected to continue to stoke as he hits the road for the next month.\"From the very first minute Brett Kavanaugh was nominated, radical Democrats were on a mission to resist, delay, demolish and destroy -- they wanted to destroy that man,\" Trump said at a rally in Iowa Tuesday night. \"In just four weeks, you will have the chance to render your verdict on the Democrats' outrageous conduct,\" he said.A White House official, talking about using Kavanaugh as an issue in the midterms, said, \"Republican voters have been happy. This is the first time they have been angry since 2016, so this comes at the right time politically for Republicans.\"Another operative said that Trump energizes base Republicans voters \"like no one else\" and, with just four weeks left before Election Day, Republicans must \"keep our side engaged and mobilized for the next 4 weeks.\"'Booster packs' for DemocratsDemocrats, on the other hand, welcome Trump's ubiquity on the trail and dismiss the idea that the party can \"Trump people to death.\"David Bergstein, national press secretary for the Democratic Senatorial Campaign Committee, said Republicans touting this strategy are the same that believed their health care and tax plans would translate well with voters, something that polls show didn't come to fruition.\"They have been wrong all cycle and they are wrong now,\" Bergstein said. \"Overwhelmingly, voters even in more conservative states, prefer a candidate who is a check and balance on the Republican control of government.\"Another Democratic source working on taking the House in November said Trump's rally not only does little in states, but it \"puts booster packs on Democratic campaigns.\"\"Candidates raise a ton of money when he comes,\" the source said. \"It's a windfall that has juiced our campaigns.\"The Democrat pointed to Rep. Conor Lamb's successful race in Pennsylvania and Danny O'Connor's narrow loss in Ohio, both special elections that Trump waded into. Both Democrats raised substantial money after the visit, which was then turned into television ads and get-out-the-vote efforts.Democrats, some of whom have positioned themselves as a foil to Trump, have also raised huge sums this year, yet another data point that suggests Democrats are positioned for a strong 2018.The Republican strategy is the reason Trump was in Iowa on Tuesday, where he stumped for Rep. David Young, the Iowa Republican looking to stave off a robust challenge from small business owner Cindy Axne, and why he traveled to Minnesota, a state her narrowly lost in 2016, earlier this month to tout a stable of Republican candidates running for House, Senate and governor.After Tuesday's visit to Iowa, Trump will have made five campaign trips this month to stump for Republican candidates. He also visited Tennessee on October 1 to tout for Rep. Marsha Blackburn's Senate campaign, Mississippi on October 2 to back Cindy Hyde-Smith for Senate and Kansas on October 6 to back Kris Kobach, who is running for governor.Trump also has a series of campaign trips on the calendar: On Wednesday he will be in Pennsylvania to back a vulnerable House candidate, on Friday he will travel to Ohio to back the state's Senate candidate and a House Republican and on Saturday he will travel to Kentucky to back Rep. Andy Barr, a Republican who is facing a tough challenge from Democrat Amy McGrath.","source":{"uri":"edition.cnn.com","dataType":"news","title":"CNN International"},"authors":[],"eventUri":null,"location":null}{"uri":"965788505","lang":"eng","isDuplicate":false,"date":"2018-10-10","time":"05:15:00","dateTime":"2018-10-10T05:15:00Z","dataType":"news","sim":0.6431372761726379,"url":"https://www.cnn.com/2018/10/10/asia/taiwan-tsai-ingwen-china-intl/index.html","title":"Taiwan's president calls on Beijing to not be a 'source of conflict' worldwide","body":"Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds.\n\n(CNN)Taiwan President Tsai Ing-wen called on China to be a \"responsible\" country on the world stage rather than provoking unnecessary conflict, amid worsening relations between Beijing and the island it considers a renegade province.\n\nTsai made the remarks during a television speech on Wednesday, Taiwan's National Day, which marks the 107th anniversary of the founding of the Republic of China, as the island is officially known.The Taiwan President said the island had no intention of recklessly provoking China but said Beijing should also avoid being a \"source of conflict.\"\"Recently, China's verbal attacks, military threats and diplomatic suppression have not only challenged cross-strait relations but also challenged the peace and stability across the strait,\" she said.Tsai said she would work to strengthen the island's national security in response to the increasing threats from Beijing, which she said had been exerting growing pressure on the island. In September, the US approved a $330 million arms sale to Taiwan, primarily spare parts for the island's air force.Read MoreTsai's speech echoes strong comments made by US Vice President Mike Pence in the United States on Thursday, where he accused the Chinese government of being a negative influence on both the US and the rest of the world.'I will not sacrifice Taiwan's sovereignty'Tsai's party is facing a tough battle at the upcoming local elections in Taiwan in November, after the president's popularity dropped following months of bad economic news and tensions with mainland China.Relations between Taipei and Beijing have cooled dramatically since Tsai was elected in 2016, resulting in clashing displays of military power and strained economic ties across the Taiwan Strait.The Chinese government is concerned about pro-independence sentiments in Tsai's ruling party, which has historically called for the island to formally separate itself from mainland China.Despite Taiwan having been self-governed since the end of the Chinese civil war in 1949, Beijing still views it as a part of its territory and has repeatedly called for its reunification with the mainland, by force if necessary.In her speech, Tsai said China's increased pressure on Taiwan had been responsible for changing the status quo across the Taiwan Strait, souring bilateral relations.\"As President, I guarantee to my citizens that I will definitely not move to confrontation in a moment of anger, and make cross-strait relations fall into danger. But I will also not ... sacrifice Taiwan's sovereignty,\" she said Wednesday.In his speech on Thursday, US Vice President Pence doubled down on previous remarks made by US President Donald Trump, saying Beijing was attempting to meddle in the upcoming US midterm elections.\"To put it bluntly, President Trump's leadership is working. China wants a different American President,\" Pence said. Beijing said in response that US claims of electoral interference were \"baseless.\"In his remarks, Pence took a forceful line on the issue of Taiwan, condemning ongoing efforts by Beijing to strip the island of its diplomatic allies around the world and forcing multinational companies to remove any references to the island as a separate entity from China.\"Taiwan's embrace of democracy shows a better path for all the Chinese people,\" he said.","source":{"uri":"edition.cnn.com","dataType":"news","title":"CNN International"},"authors":[],"eventUri":"eng-4331864","location":null}{"uri":"965787870","lang":"eng","isDuplicate":false,"date":"2018-10-10","time":"05:13:00","dateTime":"2018-10-10T05:13:00Z","dataType":"news","sim":0,"url":"https://www.huffingtonpost.com/entry/jameela-jamil-the-good-place-south-asian-diversity_us_5bbcc4c1e4b01470d055ba9e","title":"'Good Place' Actress: Sadly, It's 'Remarkable' To Have More Than 1 Asian On Set","body":"Jameela Jamil said it's refreshing to have several South Asian actresses appear on the show together.\n\nFor the past few seasons, \"The Good Place\" has received rave reviews, and the diversity of the NBC show's cast has only added value.\n\nJameela Jamil, a South Asian actress who plays boujee upper-echelon princess Tahani Al-Jamil, recently told NPR that the diversity on the show has been refreshing.\n\nShe recalled one particular episode that included her and two other South Asian actresses -- \"none of whom were playing South Asian people with South Asian accents, we were just playing people.\"\n\n\"We constantly talk about this whenever we're on screen together, that it's so nice to have more than one [of us] on set at a time, and also for that not to be the staple part of our character,\" Jamil said. \"It is really quite sad how remarkable it is, but I hope more people kind of see that we haven't bombed because there are brown people on television, and they will follow suit.\"\n\nThe U.S. entertainment industry can be limiting for actors of color. In 2015, Aziz Ansari said at EW Fest that they often have to grapple with unwritten racial quotas. And these quotas are particularly unforgiving when it comes to Asians, as \"there would never be two Indian people in one show. ... Asian people, Indian people, there can be one, but there can't be two,\" he said.\n\nSouth Asian actors also struggle in the face of Hollywood's deep-seated colorism. In April, former \"Quantico\" star Priyanka Chopra revealed that she lost out on a movie role last year because of her skin color.\n\n\"I was out for a movie, and somebody [from the studio] called one of my agents and said, 'She's the wrong -- what word did they use? -- physicality.' So in my defense as an actor, I'm like, 'Do I need to be skinnier? Do I need to get in shape? Do I need to have abs?' Like, what does 'wrong physicality' mean?\" Chopra told InStyle. \"And then my agent broke it down for me. Like, 'I think, Priy, they meant that they wanted someone who's not brown.'\"\n\nYet study after study shows that audiences crave diverse content. Research earlier this year from UCLA once again demonstrated that projects with diverse casts earn the highest box office and viewership numbers -- but Hollywood is slow to get the message.\n\n\"Our reports have continually shown that diversity sells, but the TV and film product continues to fall short,\" wrote Ana-Christina Ramón, one of the report's co-authors. \"So audiences are left starved for more representation on screen that reflects the world they see in their daily lives.\"","source":{"uri":"huffingtonpost.com","dataType":"news","title":"The Huffington Post"},"authors":[{"uri":"kimberly_yam@huffingtonpost.com","name":"Kimberly Yam","type":"author","isAgency":false}],"eventUri":null,"location":null}{"uri":"965787767","lang":"eng","isDuplicate":true,"date":"2018-10-10","time":"05:13:00","dateTime":"2018-10-10T05:13:00Z","dataType":"news","sim":0,"url":"http://www.dailyadvance.com/National-Sports/2018/10/10/LEADING-OFF-Red-Sox-ready-for-Astros-Yanks-begin-offseason.html","title":"LEADING OFF: Red Sox ready for Astros, Yanks begin offseason","body":"A look at what's happening around the majors Wednesday:\n\nMOVING ON\n\nThe Red Sox are set for a postseason rematch with the World Series champion Astros. Boston eliminated the Yankees with a dramatic 4-3 victory Tuesday night in Game 4 of their AL Division Series, and now rookie manager Alex Cora and his club will wait until Saturday night to open the AL Championship Series against Houston at Fenway Park. Ace lefty Chris Sale figures to get the ball after making an impressive turn in a setup role for the eighth inning Tuesday. It'll also mark a reunion for Cora and the Astros -- he was the bench coach during their championship run last season.\n\n\"I've been talking about them the whole season, so now we go,\" Cora said. \"Best of seven. They know me. I know them. It should be fun.\"\n\nThe Yankees, meanwhile, begin an offseason that's sure to bring a few changes. CC Sabathia, Brett Gardner, David Robertson and J.A. Happ can become free agents, and New York could be major a player in an anticipated free agent market that will likely include Manny Machado, Bryce Harper, Patrick Corbin, Dallas Keuchel and possibly even Clayton Kershaw. The Yankees have lost four straight postseason home games to the Red Sox, and now they'll watch on TV as Boston chases a fourth World Series title in 15 years -- New York has just one pennant and championship during that span (2009).\n\nSTAY OR GO?\n\nBraves manager Brian Snitker expects to find out this week whether general manager Alex Anthopolous will bring him back. Snitker is not yet under contract for 2019, though there's nothing to indicate he won't return for his third full year at the helm -- especially after a season that makes him one of the leading candidates for NL manager of the year. Still, Anthopolous met with Snitker and the coaching staff Tuesday and didn't make any promises.\n\n\"Until something gets done ... I understand that you're never guaranteed tomorrow,\" said Snitker, who turns 63 next week. \"I don't know. I know I'd like to (return). I enjoyed it. I love that group in there. I like being around 'em. That group in there is awesome. I've got a few more years in me.\"\n\nNOT A HIT\n\nSan Diego is hunting for a new hitting coach a day after firing Matt Stairs. The rebuilding Padres continued to rank at or near the bottom of the majors in key offensive stats in their first year under Stairs. His replacement will be the Padres' 10th hitting coach since Petco Park opened in 2004. While saying he felt Stairs did a good job with mostly younger players, general manager A.J. Preller said he and manager Andy Green decided that the team needed a different approach. The team is expected to promote someone from within the organization.\n\nMore AP MLB: https://apnews.com/tag/MLB and https://twitter.com/AP_Sports","source":{"uri":"dailyadvance.com","dataType":"news","title":"dailyadvance.com"},"authors":[],"eventUri":null,"location":null}